{
  ".env": "Sets the GROQ_API_KEY environment variable for API authentication.",
  ".prettierrc.json": "Configure Prettier to use single quotes, trailing commas (es5), an 80‑character line width, and enforce a specific ordering of fields in package.json via the prettier-plugin-packagejson.",
  ".vscode/launch.json": "[Define] a set of VS Code debug launch configurations for running various Node.js scripts (including the CLI, programmatic use, and refactor tools) with optional arguments and internal‑file skipping.",
  "babel.config.js": "Configure Babel to use the `@babel/preset‑env` preset with the target set to the current Node version.",
  "CHANGELOG.md": "[record] a chronological list of version releases with dates and the associated bug‑fix entries for each version.",
  "CONTRIBUTING.md": "[Guide] contributors on reporting bugs, suggesting enhancements, and submitting code changes via pull requests.",
  "eslint.config.js": "Configure ESLint with base and Prettier settings, and add specialized parsers and recommended rules for JavaScript, JSON/JSONC, and YAML files.",
  "LICENSE": "Granting permission to use, copy, modify, merge, publish, distribute, sublicense, and sell the software under the terms of the MIT License.",
  "md.config.js": "Exports a configuration object that sets default badge styling and registers multiple markdown‑magic transform plugins for file trees, badges, installation, acknowledgements, and command scripts.",
  "package-lock.json": "[Locks] exact versions of the project’s direct and transitive npm dependencies to ensure reproducible, deterministic installations.",
  "package.json": "Specify the package metadata, entry points, scripts, and distribution settings for the AI‑powered “repo‑describer” CLI tool.",
  "README.md": "Introduces the AI‑powered CLI tool `repo‑description`, its purpose and usage overview, and displays project status badges.",
  "RULES_OF_CONDUCT.md": "[Establish] a comprehensive, harassment‑free code of conduct that pledges inclusive, respectful behavior and outlines acceptable and unacceptable actions for contributors.",
  "src/cli.js": "Sets up the `repo-describer` CLI with Commander, parses arguments and options, and orchestrates repository description generation, output saving, and optional config updates.",
  "src/describe.js": "[Generate] AI‑powered descriptions of a Git repository’s files, persist those descriptions, and update markdown‑magic configuration accordingly.",
  "src/index.js": "Export... the `describeRepo`, `saveOutput`, and `updateMarkdownMagicConfig` functions as the public API of the `repo-describer` library.",
  "src/utils.js": "I’m happy to help, but I need to see the actual contents of **src\\utils.js** in order to craft an accurate one‑sentence “[action]…” description. Could you paste the file’s code (or at least the relevant portion) here?",
  "_descriptions.json": "Map each repository file to a concise description of its purpose."
}